Revit 2027 API
ColorWithTransparency.SetBlue Method
 set blue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBlue(
	uint blue
)
Public Sub SetBlue (
	blue As UInteger
)
public:
void SetBlue(
	unsigned int blue
)
member SetBlue :
        blue : uint32 -> unit
Parameters
blue UInt32
 blue
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is not valid. The valid range is 0 to 255.
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace